## diff



<details>
<summary>Diff</summary>

```diff
--- a/examples/complete/plan-target.txt
+++ b/examples/complete/plan-pr.txt
@@ -1,5 +1,347 @@
 
-No changes. Your infrastructure matches the configuration.
+Terraform used the selected providers to generate the following execution
+plan. Resource actions are indicated with the following symbols:
+  + create
+ <= read (data resources)
 
-Terraform has compared your real infrastructure against your configuration
-and found no differences, so no changes are needed.
+Terraform will perform the following actions:
+
+  # module.log-analytics.azurerm_log_analytics_workspace.main[0] will be created
+  + resource "azurerm_log_analytics_workspace" "main" {
+      + allow_resource_only_permissions = true
+      + daily_quota_gb                  = -1
+      + id                              = (known after apply)
+      + internet_ingestion_enabled      = true
+      + internet_query_enabled          = true
+      + local_authentication_disabled   = false
+      + location                        = "canadacentral"
+      + name                            = "app-test-law"
+      + primary_shared_key              = (sensitive value)
+      + resource_group_name             = "rg-test-keyapp"
+      + retention_in_days               = (known after apply)
+      + secondary_shared_key            = (sensitive value)
+      + sku                             = "PerGB2018"
+      + tags                            = {
+          + "Business_unit" = "corp"
+          + "Environment"   = "test"
+          + "Name"          = "app-test"
+        }
+      + workspace_id                    = (known after apply)
+    }
+
+  # module.private-dns-zone.azurerm_private_dns_zone.this["key_vault"] will be created
+  + resource "azurerm_private_dns_zone" "this" {
+      + id                                                    = (known after apply)
+      + max_number_of_record_sets                             = (known after apply)
+      + max_number_of_virtual_network_links                   = (known after apply)
+      + max_number_of_virtual_network_links_with_registration = (known after apply)
+      + name                                                  = "privatelink.vaultcore.azure.net"
+      + number_of_record_sets                                 = (known after apply)
+      + resource_group_name                                   = "rg-test-keyapp"
+      + tags                                                  = {
+          + "Business_unit" = "corp"
+        }
+
+      + soa_record (known after apply)
+    }
+
+  # module.private-dns-zone.azurerm_private_dns_zone_virtual_network_link.this["key_vault-0"] will be created
+  + resource "azurerm_private_dns_zone_virtual_network_link" "this" {
+      + id                    = (known after apply)
+      + name                  = (known after apply)
+      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
+      + registration_enabled  = false
+      + resource_group_name   = "rg-test-keyapp"
+      + virtual_network_id    = (known after apply)
+    }
+
+  # module.resource_group.azurerm_resource_group.default[0] will be created
+  + resource "azurerm_resource_group" "default" {
+      + id       = (known after apply)
+      + location = "canadacentral"
+      + name     = "rg-test-keyapp"
+      + tags     = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "test"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "test-keyapp"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-resource-group"
+        }
+
+      + timeouts {
+          + create = "90m"
+          + delete = "90m"
+          + read   = "5m"
+          + update = "90m"
+        }
+    }
+
+  # module.subnet.azurerm_route_table.rt[0] will be created
+  + resource "azurerm_route_table" "rt" {
+      + bgp_route_propagation_enabled = true
+      + id                            = (known after apply)
+      + location                      = "canadacentral"
+      + name                          = "app-test-route-table"
+      + resource_group_name           = "rg-test-keyapp"
+      + route                         = [
+          + {
+              + address_prefix         = "0.0.0.0/0"
+              + name                   = "rt-test"
+              + next_hop_type          = "Internet"
+                # (1 unchanged attribute hidden)
+            },
+        ]
+      + subnets                       = (known after apply)
+      + tags                          = {
+          + "Business_unit" = "corp"
+          + "Environment"   = "test"
+          + "Managedby"     = "hello@clouddrove.com"
+          + "Name"          = "app-test"
+          + "Repository"    = "https://github.com/clouddrove/terraform-azure-subnet.git"
+        }
+    }
+
+  # module.subnet.azurerm_subnet.subnet[0] will be created
+  + resource "azurerm_subnet" "subnet" {
+      + address_prefixes                              = [
+          + "10.30.1.0/24",
+        ]
+      + default_outbound_access_enabled               = true
+      + id                                            = (known after apply)
+      + name                                          = "app-subnet1"
+      + private_endpoint_network_policies             = "Disabled"
+      + private_link_service_network_policies_enabled = true
+      + resource_group_name                           = "rg-test-keyapp"
+      + virtual_network_name                          = "app-test-vnet"
+    }
+
+  # module.subnet.azurerm_subnet.subnet[1] will be created
+  + resource "azurerm_subnet" "subnet" {
+      + address_prefixes                              = [
+          + "10.30.2.0/24",
+        ]
+      + default_outbound_access_enabled               = true
+      + id                                            = (known after apply)
+      + name                                          = "app-subnet2"
+      + private_endpoint_network_policies             = "Disabled"
+      + private_link_service_network_policies_enabled = true
+      + resource_group_name                           = "rg-test-keyapp"
+      + virtual_network_name                          = "app-test-vnet"
+    }
+
+  # module.subnet.azurerm_subnet_route_table_association.main[0] will be created
+  + resource "azurerm_subnet_route_table_association" "main" {
+      + id             = (known after apply)
+      + route_table_id = (known after apply)
+      + subnet_id      = (known after apply)
+    }
+
+  # module.subnet.azurerm_subnet_route_table_association.main[1] will be created
+  + resource "azurerm_subnet_route_table_association" "main" {
+      + id             = (known after apply)
+      + route_table_id = (known after apply)
+      + subnet_id      = (known after apply)
+    }
+
+  # module.vault.data.azurerm_client_config.current_client_config will be read during apply
+  # (depends on a resource or a module with changes pending)
+ <= data "azurerm_client_config" "current_client_config" {
+      + client_id       = (known after apply)
+      + id              = (known after apply)
+      + object_id       = (known after apply)
+      + subscription_id = (known after apply)
+      + tenant_id       = (known after apply)
+    }
+
+  # module.vault.azurerm_key_vault.key_vault[0] will be created
+  + resource "azurerm_key_vault" "key_vault" {
+      + access_policy                   = [
+          + {
+              + certificate_permissions = [
+                  + "Get",
+                  + "List",
+                  + "Create",
+                  + "Delete",
+                  + "Purge",
+                  + "Recover",
+                ]
+              + key_permissions         = [
+                  + "Get",
+                  + "List",
+                  + "Create",
+                  + "Delete",
+                  + "Purge",
+                  + "Recover",
+                  + "Backup",
+                  + "Restore",
+                ]
+              + object_id               = "8d5482d8-65fd-4eac-9c7d-f75337eb0059"
+              + secret_permissions      = [
+                  + "Get",
+                  + "List",
+                  + "Set",
+                  + "Delete",
+                  + "Purge",
+                  + "Recover",
+                  + "Backup",
+                ]
+              + storage_permissions     = []
+              + tenant_id               = "bcffb719-9620-4b7c-b1b0-87ebfb2f7bdd"
+            },
+          + {
+              + certificate_permissions = [
+                  + "Get",
+                  + "List",
+                ]
+              + key_permissions         = [
+                  + "Get",
+                  + "List",
+                ]
+              + object_id               = "8d5482d8-65fd-4eac-9c7d-f75337eb0059"
+              + secret_permissions      = [
+                  + "Get",
+                  + "List",
+                ]
+              + storage_permissions     = []
+              + tenant_id               = "bcffb719-9620-4b7c-b1b0-87ebfb2f7bdd"
+            },
+        ]
+      + enable_rbac_authorization       = false
+      + enabled_for_deployment          = false
+      + enabled_for_disk_encryption     = true
+      + enabled_for_template_deployment = false
+      + id                              = (known after apply)
+      + location                        = "canadacentral"
+      + name                            = "kv-app-test-cace"
+      + public_network_access_enabled   = true
+      + purge_protection_enabled        = true
+      + resource_group_name             = "rg-test-keyapp"
+      + sku_name                        = "standard"
+      + soft_delete_retention_days      = 90
+      + tags                            = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "test"
+          + "Managedby"       = "terraform-az-m
```
See the full diff from https://github.com/terraform-az-modules/terraform-azure-key-vault/actions/runs/15559799341

</details>

[GitHub Actions](https://github.com/terraform-az-modules/terraform-azure-key-vault/actions/runs/15559799341)

<!-- diff-action -->
<!-- diff-action/Terraform plan Difference/terraform-plan-diff -->